mcu-coder/stm32_license-plate-recognition/1、源代码/user/main.c
#include "stm32f10x.h"
#include "stm32f10x_it.h"
#include "led.h"
#include "key.h"
#include "usart.h"
#include "delay.h"
#include "lcd.h"
#include "ov7670.h"
#include "string.h"
#include "bsp_esp8266.h"

//#define  WIFI  
TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
vu8 cur_status=0;
vu8 LED_flag=0;
//vu32 a=0;
//vu32 b=0;
vu16 AA=0,BB=0;
vu16 color=0;
vu16 color_save=0;//保存一个像素的值
vu8 R=0,G=0,B=0;//颜色分量
vu8 TableChangePoint_240[240];//跳变点240个
vu8 Max_ChangePoint_240=0,Min_ChangePoint_240=0,Max_bChangePoint=0,Min_bChangePoint=0;//跳变点纵轴始、末坐标,跳变点横轴始、末坐标
vu8 a_Continue=0,b_Continue=0;//记录纵、横轴突变点的连续性
vu8 flag_aMax=0;//末值更新标志
vu8 Max_aChangePoint_reset=0,Min_aChangePoint_reset=0;//修正后的上下限
vu16 Length_card=0,Width_card=0;//车牌的长和宽
vu8 Max_aChangePoint_reset_1=0,Min_aChangePoint_reset_1=0;//保存上次的数据
vu8 flag_MaxMinCompare=0;//Max_aChangePoint_reset_1和Max_aChangePoint_reset的标志
vu8 TableChangePoint_320[320];//纵向跳变点320个
float V=0.00,S=0.00,H=0.00;//定义HSV值
vu16 Min_blue=0;
vu16 Max_blue=0;//定义车牌蓝色区域的横向最大值和最小值
vu16 k1=0,kk1=0,k2=0,kk2=0,k3=0,kk3=0,k4=0,kk4=0,k5=0,kk5=0,k6=0,kk6=0,k7=0,kk7=0,k8=0,kk8=0;//八个字符边界
extern vu8 Table[6300];//所有字符集 （10+26）*150 = 5400 字节
extern vu8 talble_0[150];//字符3,测试用
extern vu8 table_yu[32];//渝字
extern vu8 table_min[32];//闽字
extern vu8 table_lu[32];//鲁字
extern vu8 table_zhe[32];//浙字
extern vu8 table_shan[32];//陕字
extern vu8 table_cuan[32];//川字
vu8 R_a=0,G_a=0,B_a=0;//阈值

vu8 table_picture[150];//定义保存图片的数组
vu8 table_char[36]={0,1,2,3,4,5,6,7,8,9,'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',};
vu8 table_char_char[36]={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',};
	vu8 table_card[5][8]={	//保存5个车牌的二维数组
{0,0,0,0,0,0,0,0},		//最后一位保存时间
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
};
vu8 tim3_num=0;//TIM3分钟计时

vu8 table_cardMeasure[7];//测量的车牌结果
void Show_Card(vu8 i);//显示第几组车牌
void Show_Title();//显示标题

void MYRCC_DeInit(void)//复位并配置向量表
{										 
	NVIC_InitTypeDef NVIC_InitStructure;	
	RCC->APB1RSTR = 0x00000000;//复位结束			 
	RCC->APB2RSTR = 0x00000000; 
	  
	/* Enable the TIM3 global Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;  //TIM3中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  //先占优先级0级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;  //从优先级3级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; //IRQ通道被使能
	NVIC_Init(&NVIC_InitStructure);  //根据NVIC_InitStruct中指定的参数初始化外设NVIC寄存器
}
void Stm32_Clock_Init(vu8 PLL)//系统时钟初始化函数  pll:选择的倍频数，从2开始，最大值为16	
{
	unsigned char temp=0;   
	MYRCC_DeInit();		  //复位并配置向量表
	RCC->CR|=0x00010000;  //外部高速时钟使能HSEON
	while(!(RCC->CR>>17));//等待外部时钟就绪
	 
	while(!(RCC->CR>>25));//等待PLL锁定
	RCC->CFGR|=0x00000002;//PLL作为系统时钟	 
	while(temp!=0x02)     //等待PLL作为系统时钟设置成功
	{   
		temp=RCC->CFGR>>2;
		temp&=0x03;
	}    
}

void LED()//LED指示灯-提示
{
	GPIO_WriteBit(LED1_GPIO_PORT, LED1_GPIO_PIN,LED_flag>>7);
	LED_flag=~LED_flag;
}
void Data_LCD_Display()//常规显示
{
	vu16 a=0,b=0;
	LCD_SetWindows(0,0,320,240);//设置显示窗口  
	GPIO_WriteBit(LCD_RS_PORT, LCD_RS_PIN,1);//标志：数据写入

	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==1);
	GPIO_WriteBit(FIFO_WRST_PORT, FIFO_WRST_PIN, 0);
	GPIO_WriteBit(FIFO_WRST_PORT, FIFO_WRST_PIN, 1);
	GPIO_WriteBit(FIFO_WR_PORT, FIFO_WR_PIN, 1);
	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==0);
	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==1);
	GPIO_WriteBit(FIFO_WR_PORT, FIFO_WR_PIN, 0);
	
	FIFO_Reset_Read_Addr(); 
 
	 
}
void RGB_HSV(vu16 num)//RGB565转HSV
{

	float max=0.00,min=0.00;
	vu8 r=0,g=0,b=0;
	r=(num>>11)*255/31;g=((num>>5)&0x3f)*255/63;b=(num&0x1f)*255/31;
	
	max=r;min=r;
	if(g>=max)max=g;
	if(b>=max)max=b;
	if(g<=min)min=g;
	if(b<=min)min=b;
	 
}
/*
车牌字符复制出的图片 宽24*高50  24*50=1200点  1200/8=150字节数据 即每行可提取出3个字节的字模数据即3*8=24个像素点
******** ******** ********
******** ******** ********
******** ******** ********
******** ******** ********
******** ******** ********
******** ******** ********
.......
*/
void Picture_String()//图片->数组table_picture   150字节   
{
	
	vu16 a=0,b=0,num1=0;
	for(a=0;a<150;a++)//归零
	{
		table_picture[a]=0x00;	
	}	
	 
}
 
vu8 MoShiShiBie_All(vu8 begin,vu8 end)//字符匹配，模式识别,选择性匹配begin-end
{
	vu16 num_save=0;
	vu8  a=0,b=0,e=0,a_save=0,st1=0,st2=0,s1=0,s2=0;
	 int num1=0;
	for(a=begin;a<end;a++)					//36
	{
		num1=0; 
		  
 		
		LCD_ShowNum(70,220,num1,4);			//显示匹配的正确像素数     <调试用> 
		LCD_ShowNum(120,220,num_save,4);//匹配的最大值显示         <调试用>
 	 	
	}
	return a_save;
}
void String_Picture()//数组->图片
{
	vu16 a=0,b=0,e=0,num1=0;
	
	for(a=0;a<50;a++)//50排
	{
		for(b=0;b<24;b++)//24行
		{
			if(talble_0[b/8+a*3]&(1<<(7-b%8)))
			{
				num1=0xffff;
			}
			else
			{
				num1=0x0000;
			}
			LCD_DrawPoint(b+296,a+191,num1);//画点
		}				
	}	
}
void WordShow(vu8 num,vu16 x,vu16 y)//显示汉字16*16
{
	vu16 a=0,b=0,e=0,num1=0;
	vu8 table1[32]={0};
	if(num==1)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_yu[a];	
		}		
	}
	if(num==2)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_min[a];	
		}		
	}
	if(num==3)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_lu[a];	
		}		
	}
	if(num==4)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_zhe[a];	
		}		
	}
	if(num==5)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_shan[a];	
		}		
	}
	if(num==6)
	{
		for(a=0;a<32;a++)
		{
			table1[a]=table_cuan[a];	
		}		
	} 
}
vu8 ZhiFuFenGe()//字符分割,返回分割的字符个数，用于判断合法性
{
	vu16 a=0,b=0;
	vu8 i=0;//统计分割的字符个数，不为9说明分割有误
	 
	for(b=Max_blue;b>Min_blue;b--) // 左右界线的扫描 
	{
		if(TableChangePoint_320[b]==0)//间隙分割  根据HSV比较 跳变点为0 代表空隙
		{
			for(a=Min_ChangePoint_240;a<Max_ChangePoint_240;a++)//划线--调试用 车牌高度一样的线
			{
 				LCD_DrawPoint(b,a+1,0x001f);
			}
			i++;b--;
			while(TableChangePoint_320[b]==0) //划过线后，找到跳变点不为0的地方
			{
				b--;
				if(b<=Min_blue) break;
			}
		}
	}
	i--;
	LCD_ShowNum(30,220,i,2);//显示分割的字符个数+1，8是正常值
	return i;
}
void GuiYi(vu16 k,vu16 kk)//归一化 24*50
{
	vu16 a=0,b=0,e=0;
	vu16 num=0;//保存读取像素
	vu8 Mo=0,Yu=0;//取整和取模
	vu8 num1=0,num2=0,num3=0;
	vu8 Mo_1=0;//
	vu8 Min_240=0,Max_240=0;//框紧字符后的上下限
	
	if((k-kk)<25)
	{
		//框紧字符
		Min_240=Min_ChangePoint_240+1; //车牌高度下限
		Max_240=Max_ChangePoint_240-1; //车牌高度上限
		 
		while(Max_240--)//框紧后，得到: Max_240
		{
			for(b=kk+1;b<k;b++)//kk1→k1                                
			{
				num=LCD_ReadPoint(b,Max_240);
				if(num) break;
			}
			if(num) break;
		}
	 
		//显示复制的图片
		num3=0;
		for(a=Min_240+1;a<Max_240;a++) //高度
		{
			num2=0;
		 
