mcu-coder/stm32_license-plate-recognition/1、源代码/user/main.c
		}
		
		num3=0;
		//图片放大算法：最近邻插值 先将宽度放大，后将长度放大  宽24*高50
		//将原有图宽度的像素点数与目标24像素点进行相减
		Mo=(24-(k-kk-1))/(k-kk-1);//取模 即可以将放大后比原图宽度多的像素点插在每个原图像素点的个数为Mo
		Yu=(24-(k-kk-1))%(k-kk-1);//取余
		if(Yu!=0) 
		{
			Mo_1=24/Yu;//平均Mo_1个像素，插有一个像素， Yu：代表需要在原图的宽度上插Yu个像素点才能达到目标的24个像素  
		}
// 		LCD_ShowNum(30,20,Mo,3);//显示模		<调试用>
// 		LCD_ShowNum(70,20,Yu,3);//显示余
// 		LCD_ShowNum(100,20,(k1-kk1),3);//显示差值

		for(a=Min_240+1;a<Max_240;a++)//宽放大为24像素    高扫描
		{//↓
			num2=0;
			Yu=(24-(k-kk-1))%(k-kk-1);//取余
			
				for(b=kk+1;b<k;b++)//kk1→k1                                   +1
				{
					num=LCD_ReadPoint(b,a);
					LCD_DrawPoint(271+num2,191+num3,num);
					num2++;
					Mo=(24-(k-kk-1))/(k-kk-1);//取模
					while(Mo)
					{
						LCD_DrawPoint(271+num2,191+num3,num);
						Mo--;
						num2++;
					}
					if(Yu!=0)//横轴拉长
					{	
						if(((num2+1)%Mo_1==0) && (num2!=1))//该插入的地方 
						{
							LCD_DrawPoint(271+num2,191+num3,num);
							Yu--;
							num2++;
						}
					}
				}
			num3++;
		}
		LCD_DrawPoint(271,191,0x07E0);//标记点，4个顶角
		LCD_DrawPoint(271,240,0x07E0);
		LCD_DrawPoint(295,191,0x07E0);
		LCD_DrawPoint(295,240,0x07E0);
//纵轴拉长
		if((Max_240-Min_240)<50)
		{
			Mo=(50-(Max_240-Min_240+1))/(Max_240-Min_240+1);//取模
			Yu=(50-(Max_240-Min_240+1))%(Max_240-Min_240+1);//取余
			Mo_1=50/Yu;
			
// 			LCD_ShowNum(30,170,Mo,3);//					<调试用>
// 			LCD_ShowNum(70,170,Yu,3);//
// 			LCD_ShowNum(100,170,Max_ChangePoint_240-Min_ChangePoint_240,3);//
			num2=0;
			for(a=0;a<(Max_240-Min_240);a++)//复制图像,考虑范围是否需要进行修正？
			{//↓
				for(b=271;b<=295;b++)//271开始复制，295才结束
				{
					num=LCD_ReadPoint(b,a+191);
					LCD_DrawPoint(b+25,191+num2,num);//复制像素值
				}
				num2++;
				while(Mo)
				{
					for(b=271;b<=295;b++)//271开始复制，295才结束
					{
						num=LCD_ReadPoint(b,a+191);
						LCD_DrawPoint(b+25,191+num2+a,num);//复制像素值
					}
					Mo--;
					num2++;
				}
				if(Yu!=0)
				{
					if((((num2+1) % Mo_1)==0)&& (num2!=1))
					{
						for(b=271;b<=295;b++)//271开始复制，295才结束
						{
							num=LCD_ReadPoint(b,a+191);
							LCD_DrawPoint(b+25,191+num2,num);//复制像素值
						}
						Yu--;
						num2++;
					}
				}					
			}
		}
		LCD_DrawPoint(320,191,0xf800);//标记点，1个顶角
	}
}
void ZhiFuShiBie()//字符识别
{
	vu16 a=0,b=0,e=0;
	vu16 i=0,u=0;
	vu8 Result=0;//识别结果
  vu8 temp[50]={0},temp1[50]={0};

	for(b=Max_blue-1;b>Min_blue;b--)//由右至左识别，获取各个字符的k,kK值
	{
		while(TableChangePoint_320[b]==0) b--;//取第1个字符
		k1=b+1;//+1 找到字符的左右边界
		while(TableChangePoint_320[b]>0) b--;
		kk1=b;     //找到字符的左右边界
		if((k1-kk1)<4)//省略低于三个像素的位置
		{
			while(TableChangePoint_320[b]==0) b--;// 重新找一个左右边界
			k1=b+1;//+1
			while(TableChangePoint_320[b]>0) b--;
			kk1=b;
		}
		  
		if((k5-kk5)<4)//省略低于3个像素的位置
		{
			while(TableChangePoint_320[b]==0) b--;//
			k5=b+1;//+1
			while(TableChangePoint_320[b]>0) b--;
			kk5=b;
		}
		while(TableChangePoint_320[b]==0) b--;//取第6个字符
		k6=b+1;
		while(TableChangePoint_320[b]>0) b--;
		kk6=b;
		while(TableChangePoint_320[b]==0) b--;//取第7个字符
		 
		while(TableChangePoint_320[b]==0) b--;//取第8个字符
		k8=b+1;
 		while(TableChangePoint_320[b]>0) 
		{
			if(b<=Min_blue)
			{
				break;
			}
			b--;
		}
		kk8=b;
		b=Min_blue;//以防万一，还满足for循环条件
	}
	for(a=Min_ChangePoint_240;a<Max_ChangePoint_240;a++)//划线  将分割出的左右边界显示出来
	{
		LCD_DrawPoint(k1,a+1,0x001f);
		LCD_DrawPoint(kk1,a+1,0x001f);
		LCD_DrawPoint(k2,a+1,0x001f);
		LCD_DrawPoint(kk2,a+1,0x001f);
	 
		LCD_DrawPoint(kk6,a+1,0x001f);
		LCD_DrawPoint(k7,a+1,0x001f);
		LCD_DrawPoint(kk7,a+1,0x001f);
		LCD_DrawPoint(k8,a+1,0x001f);
		LCD_DrawPoint(kk8,a+1,0x001f);
	}
//归一化处理：大小为24*50
	
//第1个字符：
	GuiYi(k1,kk1);//归一化 24*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(0,36);//字符匹配，模式识别,返回a,0<= a <36
	if(Result<10)
	{
		LCD_ShowNum(240,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(240,220,table_char[Result],0);
	}
	table_cardMeasure[6]=Result;//保存识别的车牌结果
	
//第2个字符：
	GuiYi(k2,kk2);//归一化 25*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(0,36);//字符匹配，模式识别
	if(Result<10)
	{
		LCD_ShowNum(230,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(230,220,table_char[Result],0);
	}
	table_cardMeasure[5]=Result;//保存识别的车牌结果
	
	GuiYi(k3,kk3);//归一化 25*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(0,36);//字符匹配，模式识别
	if(Result<10)
	{
		LCD_ShowNum(220,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(220,220,table_char[Result],0);
	}
	table_cardMeasure[4]=Result;//保存识别的车牌结果
	
	GuiYi(k4,kk4);//归一化 25*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(0,36);//字符匹配，模式识别
	if(Result<10)
	{
		LCD_ShowNum(210,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(210,220,table_char[Result],0);
	}
	table_cardMeasure[3]=Result;//保存识别的车牌结果
	
	GuiYi(k5,kk5);//归一化 25*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(0,36);//字符匹配，模式识别
	if(Result<10)
	{
		LCD_ShowNum(200,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(200,220,table_char[Result],0);
	}
	table_cardMeasure[2]=Result;//保存识别的车牌结果
	
	LCD_ShowChar(190,220,'.',0);

	GuiYi(k7,kk7);//归一化 25*50
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(10,36);//字符匹配，模式识别，只匹配字母
	if(Result<10)
	{
		LCD_ShowNum(180,220,table_char[Result],1);
	}
	else
	{
		LCD_ShowChar(180,220,table_char[Result],0);
	}
	table_cardMeasure[1]=Result;//保存识别的车牌结果
	
	GuiYi(k8,kk8);//归一化 25*50					最后一个汉字
	Picture_String();//图片->数组
	Result=MoShiShiBie_All(36,42);//字符匹配，匹配汉字
	WordShow(Result-35,160,220);//显示汉字
	table_cardMeasure[0]=Result-35;//保存识别的车牌结果
	 
	sprintf((char*)temp1,"%c.%c%c%c%c%c\r\n"
		,table_char_char[table_cardMeasure[1]],table_char_char[table_cardMeasure[2]],
	table_char_char[table_cardMeasure[3]],table_char_char[table_cardMeasure[4]],
	table_char_char[table_cardMeasure[5]],table_char_char[table_cardMeasure[6]]);
#ifdef WIFI
 strcat((char*)temp,temp1);
	ESP8266_SendString(DISABLE,temp,strlen(temp),Multiple_ID_0);
#endif
	//	printf("%c",table_char_char[table_cardMeasure[1]]);
//	printf("."); 
//	printf("%c",table_char_char[table_cardMeasure[2]]);
//	printf("%c",table_char_char[table_cardMeasure[3]]);
//	printf("%c",table_char_char[table_cardMeasure[4]]);
//	printf("%c",table_char_char[table_cardMeasure[5]]);
//	printf("%c",table_char_char[table_cardMeasure[6]]);
//	printf("\r\n");
	

	//串口发送车牌信息     //
//	if(Result==36)
//	{
//		USART1_SendChar('Y');USART1_SendChar('u');USART1_SendChar('-');
//	}
//	else if(Result==37)
//	{
//		USART1_SendChar('M');USART1_SendChar('i');USART1_SendChar('n');
//	}
//	else if(Result==38)
//	{
//		USART1_SendChar('H');USART1_SendChar('u');USART1_SendChar('-');
//	}
//	else if(Result==39)
//	{
//		USART1_SendChar('Z');USART1_SendChar('h');USART1_SendChar('e');
//	}
//	else if(Result==40)
//	{
//		USART1_SendChar('S');USART1_SendChar('a');USART1_SendChar('n');
//	}
//	else if(Result==41)
//	{
//		USART1_SendChar('Y');USART1_SendChar('u');USART1_SendChar('e');
//	}
//	USART1_SendChar(table_char_char[table_cardMeasure[1]]);
//	USART1_SendChar('.');
//	USART1_SendChar(table_char_char[table_cardMeasure[2]]);
//	USART1_SendChar(table_char_char[table_cardMeasure[3]]);
//	USART1_SendChar(table_char_char[table_cardMeasure[4]]);
//	USART1_SendChar(table_char_char[table_cardMeasure[5]]);
//	USART1_SendChar(table_char_char[table_cardMeasure[6]]);
	//先匹配已保存的车牌号
	for(u=0;u<5;u++)
	{
				for(i=0;i<7;i++)
				{
					if(table_card[u][i]!=table_cardMeasure[i]) i=8;//退出for循环
				}	
			if(i==7)//匹配成功
			{
				LCD_Fill(0x00);//黑屏
				Show_Title();//显示标题
				Show_Card(u);//显示第几组车牌			
				u=5;
				while(GPIO_ReadInputDataBit(KEY1_PORT,KEY2_PIN)==1);
			}
	}
	if(i==9)//无匹配车牌，则保存车牌
	{
		i=0;
		while(1)
		{
			if(GPIO_ReadInputDataBit(KEY1_PORT,KEY2_PIN)==0) break;
			LCD_ShowNum(30,220,i/100,2);
			if(i==300)														//保存数据
			{
				for(u=0;u<5;u++)
				{
					if(table_card[u][0]==0)
					{
						for(i=0;i<7;i++)
						{
							table_card[u][i]=table_cardMeasure[i];
						}					
						u=5;//退出循环
					}
				}
				LCD_Fill(0x00);//黑屏
				Show_Title();//显示标题
				Show_Card(0);//显示第几组车牌
				Show_Card(1);
				Show_Card(2);
				Show_Card(3);
				Show_Card(4);
			 while(GPIO_ReadInputDataBit(KEY1_PORT,KEY2_PIN)==1);
				break;
			}
			delay_ms(1);
			i++;
		}
		
