mcu-coder/stm32_license-plate-recognition/1、源代码/user/main.c
	}
	
}
 
void ChangePoint_Show_240()//240方向跳变点显示
{
	vu16 a=0,b=0;
	for(a=0;a<240;a++)//建立参考线10、20、30
	{
		LCD_DrawPoint(10,a,0x63<<5);//10
		LCD_DrawPoint(20,a,0x63<<5);//20
		LCD_DrawPoint(30,a,0x63<<5);//30
	}
	
	for(a=0;a<240;a++)//显示对应的横向跳变点								
	{
		LCD_DrawPoint(TableChangePoint_240[a],a,0xf800);//跳变点显示，红色标记
		if(TableChangePoint_240[a]>=12)					//跳变点个数（阈值）设定       阈值调节3-（1）
		{
			for(b=35;b<40;b++)						//显示达到阈值标准的点
			{
				LCD_DrawPoint(b,a,0x63<<5);//Green			
			}
		}
	}
}
void ChangePoint_Analysis_240()//240跳变点分析  获取高度
{
	vu16 a=0,b=0;
	Min_ChangePoint_240=240;Max_ChangePoint_240=0;
	
	for(a=0;a<240;a++)//240扫描	，获取上下限值	：Min_ChangePoint_240，Max_ChangePoint_240				
	{
		while(TableChangePoint_240[a]<12)									//阈值调节3-（2）
		{
			a++;
		}
		Min_ChangePoint_240=a;//上边界
		while(TableChangePoint_240[a]>=12)									//阈值调节3-（3）
		{
			a++;
		}
		Max_ChangePoint_240=a;//下边界
		if(Max_ChangePoint_240-Min_ChangePoint_240>=15) a=240;//连续性阈值   	//阈值调节2-（1）
	}
	 
	for(a=30;a<280;a++)//显示下界限						
	{
		LCD_DrawPoint(a,Min_ChangePoint_240,0x001f);
	}
	for(a=30;a<280;a++)//显示50,参考50像素位置处，车牌位置不要超过这根线，免得不能字符的归一化处理						
	{
		LCD_DrawPoint(a,Min_ChangePoint_240+50,0xf800);
	}
	flag_MaxMinCompare=1;
	if(Min_ChangePoint_240>Max_ChangePoint_240)//判断合法性1：最小值>最大值
	{
		flag_MaxMinCompare=0;
	}
	if(Min_ChangePoint_240==240||Max_ChangePoint_240==0)//判断合法性2：值没有重新赋值
	{
		flag_MaxMinCompare=0;
	}
	if(Max_ChangePoint_240-Min_ChangePoint_240<15)		//判断合法性3：			//阈值调节2-（2）
	{
		flag_MaxMinCompare=0;
	}
}
void ChangePoint_Analysis_Blue()//320蓝色区域分析,采用读取像素，得结果Min_blue,Max_blue
{
	vu16 a=0,b=0,num_color=0;
	vu16 min_320=0,max_320=0;//各行的最小、最大值
	
	Min_blue=0;Max_blue=320;
	min_320=320;max_320=0;
	
	for(a=Min_ChangePoint_240;a<Max_ChangePoint_240;a++) //在上下边界扫描								
	{
		for(b=30;b<290;b++)//不用到320    for(b=30;b<320;b++)
		{
			num_color=LCD_ReadPoint(b,a);//读取像素，代码优化速度有待提升 ？扫描方法也可优化，以提升速度
			RGB_HSV(num_color);//RGB565转HSV
			if( 250>H && H>190 && 60>S && S>15 && 100>V && V>45)// 和 蓝色HSV 阈值比较
			{
				if(b<min_320)//获得横轴的Min和Max值，即蓝色车牌的左右边界
				{
					min_320=b;  //得到左边界
				}
				if(b>max_320)
				{
					max_320=b;  //得到右边界
				}
			}
		}
	}
	Min_blue=min_320;  //获取各行的最大值//修正一点
	Max_blue=max_320-5;//获取各行的最小值//修正一点
	 

}
 
void ChangePoint_Show_320()//320方向跳变点显示
{
	vu16 a=0,b=0;
	for(a=0;a<320;a++)//显示对应的横向跳变点								
	{
		if(TableChangePoint_320[a]==0)
		{
			LCD_DrawPoint(a,0,0x001F);//跳变点显示，红色标记
		}
		else
		{
			LCD_DrawPoint(a,TableChangePoint_320[a],0xf800);//跳变点显示，红色标记
		}
		

	}
}
void ChangePoint_Analysis_320()//蓝色区域中，320跳变点分析,获得TableChangePoint_320[b]结果
{								//(先二值化，再判断白点个数，=0则是分割线）
	vu16 a=0,b=0,num_color=0;
	vu8 R1=0,G1=0,B1=0;
	vu8 Mid_ChangePoint_240=0;
	vu8 max_R=0,max_G=0,max_B=0,min_R=0,min_G=0,min_B=0;
	vu8 mid_R=0,mid_G=0,mid_B=0;
	
	max_R=0;max_G=0;max_B=0;
	min_R=30;min_G=60;min_B=30;
	
	Mid_ChangePoint_240=(Min_ChangePoint_240+Max_ChangePoint_240)/2;
	
	for(b=Min_blue;b<Max_blue;b++) //左右边界
	{
		num_color=LCD_ReadPoint(b,Mid_ChangePoint_240);//读取像素，代码优化速度有待提升 ？扫描方法也可优化，以提升速度
	 
	}
	mid_R=(max_R+min_R)/2;
	mid_G=(max_G+min_G)/2;
	mid_B=(max_B+	min_B)/2;
// 	LCD_ShowNum(30,200,max_R,2);//X坐标，Y坐标，数字，几位数		<调试用>
// 	LCD_ShowNum(70,200,max_G,2);//X坐标，Y坐标，数字，几位数
// 	LCD_ShowNum(100,200,max_B,2);//X坐标，Y坐标，数字，几位数
// 	
// 	LCD_ShowNum(30,220,min_R,2);//X坐标，Y坐标，数字，几位数
// 	LCD_ShowNum(70,220,min_G,2);//X坐标，Y坐标，数字，几位数
// 	LCD_ShowNum(100,220,min_B,2);//X坐标，Y坐标，数字，几位数
	for(b=0;b<320;b++)//各行跳变点计数，数组清零
	{
		TableChangePoint_320[b]=0;
	}
	for(a=Min_ChangePoint_240;a<Max_ChangePoint_240;a++)								
	{
		for(b=Min_blue+1;b<Max_blue;b++)
		{
			num_color=LCD_ReadPoint(b,a);//读取像素，代码优化速度有待提升 ？扫描方法也可优化，以提升速度
			R1=num_color>>11;
			G1=(num_color>>5)&0x3F;
			B1=num_color&0x1F;
			if((R1>=mid_R) && (G1>=mid_G) && (B1>=mid_B))//二值化,高阈值：25.55.25，较合适阈值（21,47,21）
			{
				LCD_DrawPoint(b,a,0xffff);
				TableChangePoint_320[b]++;//白色，跳变点+1
			}
			else
			{
				LCD_DrawPoint(b,a,0x0000);
			}
		}
	}
}

void Data_LCD_ColorChange()//摄像头扫描
{
	vu16 a=0,b=0;
	vu8 i=0;
	for(a=0;a<240;a++)//各行跳变点计数，数组清零
	{
		TableChangePoint_240[a]=0;
	}
	Min_blue=320;//初始化记录蓝色车牌区域的值
	Max_blue=0;
	
	LCD_SetWindows(0,0,320,240);//设置显示窗口
	GPIO_WriteBit(LCD_RS_PORT, LCD_RS_PIN,1);//标志：数据写入

	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==1);
	GPIO_WriteBit(FIFO_WRST_PORT, FIFO_WRST_PIN, 0);
	GPIO_WriteBit(FIFO_WRST_PORT, FIFO_WRST_PIN, 1);
	GPIO_WriteBit(FIFO_WR_PORT, FIFO_WR_PIN, 1);
	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==0);
	while(GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_0)==1);
	GPIO_WriteBit(FIFO_WR_PORT, FIFO_WR_PIN, 0);
	
	FIFO_Reset_Read_Addr(); 
 
	
	for (a=0;a<240;a++) //扫描检测240  即宽度
	{
		for(b=0;b<320;b++)
		{
			GPIOC->BRR =1<<4;
			AA=GPIOA->IDR;						
			GPIOC->BSRR =1<<4;
			
			GPIOC->BRR =1<<4;
			BB=GPIOA->IDR&0x00ff;								
			GPIOC->BSRR =1<<4;	
			
			color=(AA<<8)|BB;

			R=color>>11;
			G=(color>>5)&0x3f;
			B=color&0x1f;
			
			if((R>R_a) && (G>=G_a) && (B>=B_a))//二值化,高阈值：25.55.25，较合适阈值（21,47,21）
			{
				color=0xffff; //白色
			}
			else
			{
				color=0x0000; //黑色
			}
			
			if(color!=color_save)//跳变点
			{
				TableChangePoint_240[a]++;		//该行跳变点计数+1
			}
			color_save=color;//保存像素值，供下一次判断和比较
			
			color=(AA<<8)|BB;//还原色彩
					
			LCD_DATA_PORT->ODR = color;
			GPIOC->BRR =1<<11;
			GPIOC->BSRR =1<<11;
		}
	}
	
	ChangePoint_Show_240();//240方向跳变点显示  
	ChangePoint_Analysis_240();	//跳变点分析    获得车牌高度
	//返回flag_MaxMinCompare，Min_ChangePoint_240，Max_ChangePoint_240
	if(flag_MaxMinCompare==1)//跳变点筛选成功  即高度合理
	{
			BEEP_ON;
			delayms(500);
			BEEP_OFF;
		//分析显示车牌左右边界
		 ChangePoint_Analysis_Blue();//320蓝色区域分析,采用读取像素，得结果Min_blue,Max_blue  分析车牌左右边界
		if(Min_blue>Max_blue) 
			flag_MaxMinCompare=0;//进行合理性判断1
		if((Min_blue>290)||(Max_blue>290)) 
			flag_MaxMinCompare=0;//进行合理性判断2
	}
	if(flag_MaxMinCompare==1)//跳变点筛选成功  左右边界获取成功 并且合理
	{
		ChangePoint_Analysis_320();//蓝色区域中，320跳变点分析,获得：TableChangePoint_320[b]结果 左右边界内二值化
		ChangePoint_Show_320();//320方向跳变点显示
		i=ZhiFuFenGe(); 
		
